import random
pla=int(input("Введи количество игроков: "))
if pla == 4:
    x1=random.choice([input("Введи первого игрока: "), input("Введи второго игрока: "), input("Введи третьего игрока: "), input("Введи четвёртого игрока: ")])
if pla == 5:
    x1=random.choice([input("Введи первого игрока: "), input("Введи второго игрока: "), input("Введи третьего игрока: "), input("Введи четвёртого игрока: "), input("Введи пятого игрока: ")])
if pla == 6:
    x1=random.choice([input("Введи первого игрока: "), input("Введи второго игрока: "), input("Введи третьего игрока: "), input("Введи четвёртого игрока: "), input("Введи пятого игрока: "), input("Введи шестого игрока: ")])
if pla == 7:
    x1=random.choice([input("Введи первого игрока: "), input("Введи второго игрока: "), input("Введи третьего игрока: "), input("Введи четвёртого игрока: "), input("Введи пятого игрока: "), input("Введи шестого игрока: "), input("Введи седьмого игрока: ")])
if pla == 8:
   x1=random.choice([input("Введи первого игрока: "), input("Введи второго игрока: "), input("Введи третьего игрока: "), input("Введи четвёртого игрока: "), input("Введи пятого игрока: "), input("Введи шестого игрока: "), input("Введи седьмого игрока: "), input("Введи восьмого игрока: ")])
if pla == 9:
    x1=random.choice([input("Введи первого игрока: "), input("Введи второго игрока: "), input("Введи третьего игрока: "), input("Введи четвёртого игрока: "), input("Введи пятого игрока: "), input("Введи шестого игрока: "), input("Введи седьмого игрока: "), input("Введи восьмого игрока: "), input("Введи девятого игрока: ")])
if pla == 10:
    x1=random.choice([input("Введи первого игрока: "), input("Введи второго игрока: "), input("Введи третьего игрока: "), input("Введи четвёртого игрока: "), input("Введи пятого игрока: "), input("Введи шестого игрока: "), input("Введи седьмого игрока: "), input("Введи восьмого игрока: "), input("Введи девятого игрока: "), input("Введи десятого игрока: ")])
print(x1)
input()
